---
kind: type
id: T:Autodesk.Revit.DB.FilterStringContains
source: html/0441350e-c091-9229-82b6-bba846bf0f16.htm
---
# Autodesk.Revit.DB.FilterStringContains

Tests whether string values from the document contain a certain string.

## Syntax (C#)
```csharp
public class FilterStringContains : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.